# list(Data frame)

In [15]:
import pandas as pd


data = [
    ["Ali", 20, 88],
    ["Faiqa", 22, 92],
    ["John", 19, 79]
]

df = pd.DataFrame(data, columns=["Name", "Age", "Marks"])
print(df)

    Name  Age  Marks
0    Ali   20     88
1  Faiqa   22     92
2   John   19     79

In [16]:
import pandas as pd

In [17]:
df = pd.read_csv("C:\\Users\\Gateway\\Desktop\\seattle-weather.csv")

In [18]:
df

            date  precipitation  temp_max  temp_min  wind  weather
0       1/1/2012            0.0      12.8       5.0   4.7  drizzle
1       1/2/2012           10.9      10.6       2.8   4.5     rain
2       1/3/2012            0.8      11.7       7.2   2.3     rain
3       1/4/2012           20.3      12.2       5.6   4.7     rain
4       1/5/2012            1.3       8.9       2.8   6.1     rain
...          ...            ...       ...       ...   ...      ...
1456  12/27/2015            8.6       4.4       1.7   2.9     rain
1457  12/28/2015            1.5       5.0       1.7   1.3     rain
1458  12/29/2015            0.0       7.2       0.6   2.6      fog
1459  12/30/2015            0.0       5.6      -1.0   3.4      sun
1460  12/31/2015            0.0       5.6      -2.1   3.5      sun

[1461 rows x 6 columns]

In [19]:
df = pd.read_csv("C:\\Users\\Gateway\\Desktop\\balanced_ai_human_prompts.csv")

In [20]:
df

                                                   text  generated
0     Machine learning, a subset of artificial intel...          1
1     A decision tree, a prominent machine learning ...          1
2     Education, a cornerstone of societal progress,...          1
3     Computers, the backbone of modern technology, ...          1
4     Chess, a timeless game of strategy and intelle...          1
...                                                 ...        ...
2745  Generate a detailed summary of global healthca...          1
2746  Compose an in-depth exploration of financial t...          1
2747  Generate a detailed summary of autonomous vehi...          1
2748  Develop a persuasive argument about internet o...          1
2749  Generate a detailed summary of supply chain ma...          1

[2750 rows x 2 columns]

# pandas series

In [1]:
import pandas as pd

marks = pd.Series([90, 85, 78, 92])
print(marks)

0    90
1    85
2    78
3    92
dtype: int64

# pandas DataFrame

In [2]:
import pandas as pd

data = {
    "Name": ["Areej", "Faiqa", "Laiba"],
    "Age": [20, 22, 19],
    "Marks": [88, 92, 79]
}

df = pd.DataFrame(data)
print(df)

    Name  Age  Marks
0  Areej   20     88
1  Faiqa   22     92
2  Laiba   19     79

# Basic operations in pandas

In [3]:
print(df.head())      
print(df["Name"])    
print(df.describe())  
print(df.info())

    Name  Age  Marks
0  Areej   20     88
1  Faiqa   22     92
2  Laiba   19     79
0    Areej
1    Faiqa
2    Laiba
Name: Name, dtype: object
             Age      Marks
count   3.000000   3.000000
mean   20.333333  86.333333
std     1.527525   6.658328
min    19.000000  79.000000
25%    19.500000  83.500000
50%    20.000000  88.000000
75%    21.000000  90.000000
max    22.000000  92.000000
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   Marks   3 non-null      int64
dtypes: int64(2), object(1)
memory usage: 204.0+ bytes
None

# pivot table in pandas

In [5]:
import pandas as pd

data = {
    "Name": ["Shukriya", "Faiqa", "Shukriya", "Laiba", "Faiqa", "Laiba"],
    "Subject": ["Math", "Math", "Science", "Math", "Science", "Science"],
    "Marks": [88, 92, 85, 75, 89, 80]
}

df = pd.DataFrame(data)
print("Original Data:")
print(df)

pivot = pd.pivot_table(df, values="Marks", index="Name", columns="Subject", aggfunc="mean")
print("\nPivot Table:")
print(pivot)

Original Data:
       Name  Subject  Marks
0  Shukriya     Math     88
1     Faiqa     Math     92
2  Shukriya  Science     85
3     Laiba     Math     75
4     Faiqa  Science     89
5     Laiba  Science     80

Pivot Table:
Subject   Math  Science
Name
Faiqa     92.0     89.0
Laiba     75.0     80.0
Shukriya  88.0     85.0

# List Dataframe

In [8]:
import pandas as pd

data = [
    ["Shukriya", 20, 88],
    ["Faiqa", 22, 92],
    ["Laiba", 19, 79]
]

df = pd.DataFrame(data, columns=["Name", "Age", "Marks"])
print(df)

       Name  Age  Marks
0  Shukriya   20     88
1     Faiqa   22     92
2     Laiba   19     79

# Dictionary Dataframe

In [10]:
data = {
    "Name": ["Shukriya", "Faiqa", "Laiba"],
    "Age": [20, 22, 19],
    "Marks": [88, 92, 79]
}

df = pd.DataFrame(data)
print(df)

       Name  Age  Marks
0  Shukriya   20     88
1     Faiqa   22     92
2     Laiba   19     79

# Tuples Data frame

In [11]:
data = [
    ("Shukriya", 20, 88),
    ("Faiqa", 22, 92),
    ("Laiba", 19, 79)
]

df = pd.DataFrame(data, columns=["Name", "Age", "Marks"])
print(df)

       Name  Age  Marks
0  Shukriya   20     88
1     Faiqa   22     92
2     Laiba   19     79

In [1]:
import pandas as pd
e_data=pd.DataFrame()
print(e_data)

Empty DataFrame
Columns: []
Index: []

In [2]:
list=['a','b','c','d','w']
print(list)
d2=pd.DataFrame(list)
print(d2)

['a', 'b', 'c', 'd', 'w']
   0
0  a
1  b
2  c
3  d
4  w

In [3]:
list2=[[1,2,3,4,5],[4,5,6,7,8]]
print(list2)
pd3=pd.DataFrame(list2)
pd3

[[1, 2, 3, 4, 5], [4, 5, 6, 7, 8]]

   0  1  2  3  4
0  1  2  3  4  5
1  4  5  6  7  8

In [4]:
list3=[[1,2,3,4,5],[4,5,6,7,8],['a','b','c','d','e']]
print(list3)
c4=pd.DataFrame(list3)
print(d4)

[[1, 2, 3, 4, 5], [4, 5, 6, 7, 8], ['a', 'b', 'c', 'd', 'e']]
   0  1  2  3  4
0  1  2  3  4  5
1  4  5  6  7  8
2  a  b  c  d  e

In [ ]:
df6=pd.DataFrame({'ID':[5,6,7,8],
 'Name':['D','E','F','G']
 'Class':['W','X','Y','Z']})